Revit 2027 API
BuiltInFailures.SketchFailures.LinesOverlapError Property
 Cannot have overlapping lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinesOverlapError { get; }
Public Shared ReadOnly Property LinesOverlapError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinesOverlapError {
	FailureDefinitionId^ get ();
}
static member LinesOverlapError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace